#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

OpenTofu
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Reading...
module.control-planes.konnect_gateway_control_plane.cps["dev_au_cloud"]: Refreshing state... [id=ab008315-b9bb-4542-b448-d90e3e611a62]
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Read complete after 0s
module.networks["dev_au"].konnect_cloud_gateway_network.cgw_network: Refreshing state... [id=4c0d6de4-0f21-4de9-8071-d92f4eee1887]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["gary"]: Refreshing state... [id=4c1e7df7-af17-4274-bf30-f92fa27295ab]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["bob"]: Refreshing state... [id=074b72db-cab8-4ea0-9c8d-8af7f7004179]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["tom"]: Refreshing state... [id=e87f422e-1a74-48d7-b429-3e3b3e8d3cdc]
module.kong-configs-dev-au-cloud.konnect_gateway_route.catch_all: Refreshing state... [id=3a07fa81-b40c-4b25-90e1-4642f710cf03]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["robin"]: Refreshing state... [id=452f9b70-e89a-4b19-8e6e-b4558492a9c4]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alex"]: Refreshing state... [id=00d72cac-c599-409a-a344-27c39d8670cc]
module.kong-configs-dev-au-cloud.konnect_gateway_service.httpbin: Refreshing state... [id=454dc644-b567-4313-a7d2-e928e840d592]
module.kong-configs-dev-au-cloud.konnect_gateway_service.echo: Refreshing state... [id=fb6f1dae-b325-4dcf-9025-18e38b79b096]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alice"]: Refreshing state... [id=3c787c32-6523-4b98-a673-15c4bd644db1]
module.kong-configs-dev-au-cloud.konnect_gateway_plugin_key_auth.key_auth: Refreshing state... [id=a76b70d1-6aae-465e-ad6a-8b622068816e]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["anna"]: Refreshing state... [id=0fa715df-1efb-4012-93f6-2c42d8748a40]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["joe"]: Refreshing state... [id=9ef7eab2-e0b7-4d12-afc1-b6393a966a87]
module.kong-configs-dev-au-cloud.konnect_gateway_plugin_request_termination.catch_all_terminate: Refreshing state... [id=fa1a0c04-1c5e-4d12-b866-2b5576d20807]
module.kong-configs-dev-au-cloud.konnect_gateway_route.httpbin: Refreshing state... [id=776f54a2-5727-4eee-a728-db7e7132e0ef]
module.kong-configs-dev-au-cloud.konnect_gateway_route.echo: Refreshing state... [id=1ebee070-1cf8-4235-8467-8a2ed676add7]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["joe"]: Refreshing state... [id=d17b19a8-3876-43a6-a2b6-c3f4494607e6]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["bob"]: Refreshing state... [id=c20dfeec-57a7-4eac-8a5c-04fdd3c214c2]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alex"]: Refreshing state... [id=88c2647b-015f-4cb0-8cef-8d163a270dbb]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["tom"]: Refreshing state... [id=dd438ffb-7da4-4243-9425-efa7539360b7]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alice"]: Refreshing state... [id=d0127e81-54ce-4a2e-b3c4-6f859abd3c2b]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["anna"]: Refreshing state... [id=26351a2e-71c0-4c33-b7ef-2a806cc3adc5]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["robin"]: Refreshing state... [id=11ed6932-b2ef-46c4-935e-ca6f8f21656c]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["gary"]: Refreshing state... [id=3036a1a7-432a-4ed4-b13b-d6bde32c52e1]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.cloud-gateways["dev_au"].konnect_cloud_gateway_configuration.cgw_dp will be created
  + resource "konnect_cloud_gateway_configuration" "cgw_dp" {
      + api_access             = "private+public"
      + control_plane_geo      = "au"
      + control_plane_id       = "ab008315-b9bb-4542-b448-d90e3e611a62"
      + created_at             = (known after apply)
      + dataplane_group_config = (known after apply)
      + dataplane_groups       = [
          + {
              + autoscale                = {
                  + configuration_data_plane_group_autoscale_autopilot = (known after apply)
                  + configuration_data_plane_group_autoscale_static    = {
                      + instance_type       = "small"
                      + kind                = "static"
                      + requested_instances = 1
                    }
                }
              + cloud_gateway_network_id = "4c0d6de4-0f21-4de9-8071-d92f4eee1887"
              + created_at               = (known after apply)
              + egress_ip_addresses      = (known after apply)
              + id                       = (known after apply)
              + private_ip_addresses     = (known after apply)
              + provider                 = "aws"
              + region                   = "ap-southeast-2"
              + state                    = (known after apply)
              + updated_at               = (known after apply)
            },
        ]
      + entity_version         = (known after apply)
      + id                     = (known after apply)
      + updated_at             = (known after apply)
      + version                = "3.7"
    }

  # module.cloud-gateways["dev_au"].konnect_cloud_gateway_custom_domain.cgw_custom_domain will be created
  + resource "konnect_cloud_gateway_custom_domain" "cgw_custom_domain" {
      + certificate_id    = (known after apply)
      + control_plane_geo = "au"
      + control_plane_id  = "ab008315-b9bb-4542-b448-d90e3e611a62"
      + created_at        = (known after apply)
      + domain            = "proxy.fomm.au"
      + entity_version    = (known after apply)
      + id                = (known after apply)
      + sni_id            = (known after apply)
      + state             = (known after apply)
      + state_metadata    = (known after apply)
      + updated_at        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_gateway_edge_urls = {
      + dev_au = {
          + custom_domain   = "https://proxy.fomm.au"
          + public_edge_dns = "https://40114e188f.gateways.konghq.com"
          + status          = (known after apply)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @liyangau, Action: `pull_request`*